import 'package:clipboard/clipboard.dart';
import 'package:flutter/material.dart';
import 'package:fluttertoast/fluttertoast.dart';
import 'package:share_plus/share_plus.dart';

class gridviewshayari extends StatefulWidget {
  List gridlist;
  int index;
  gridviewshayari(this.gridlist, this.index);

  @override
  State<gridviewshayari> createState() => _gridviewshayariState();
}

class _gridviewshayariState extends State<gridviewshayari> {
  List temp = [];

  List ghazal = [
    """सूरज, सितारे चाँद मेरे साथ में रहे
जब तक तुम्हारे हाथ मेरे हाथ में रहे

साँसों की तरह साथ रहे सारी ज़िंदगी
तुम ख़्वाब से गए तो ख़्यालात में रहे

हर बूँद तीर बन के उतरती है रूह में
तन्हा मेरा तरह कोई बरसात में रहे

हर रंग हर मिज़ाज में पाया है आपको
मौसम तमाम आपकी ख़िदमत में रहे

शाखों से टूट जाएं वो पत्ते नहीं हैं हम
आँधी से कोई कह दे के औक़ात में रहे""",
    """सर को छुपाने को नए ठिकाने मिलें 
आँखें खुले तो खुशी के ज़माने मिले

महफिल जमा होती रहे मेरे दर पे बारहा 
जब भी गले मिलें तो मेरे यार पुराने मिलें

लिखता हूँ तेरा नाम मैं अब भी दीवारों पर 
खोलूँ जो मैं संदूक खतों के खजाने मिलें

तेरी गली से नाता ना टूटे कभी मेरा 
नज़रें मिलाने के हमें ताज़ा बहाने मिलें

जब शहर की गलियाँ भी मेरा साथ नहीं दें
उस पल मेरी किस्मत में नए आशियाने मिलें""",
    """इरादा था कि मैं कुछ देर तूफाँ का मजा लेता
मगर बेचारे दरिया को उत्तर जाने की जल्दी थी।

मैं अपनी मुट्ठियों में कैद कर लेता ज़मीनों को
मगर मेरे कबीले को बिखर जाने की जल्दी थी।

मैं आखिर कौन सा मौसम तुम्हारे नाम कर देता
यहाँ हर एक मौसम को गुजर जाने की जल्दी थी।

 वो शाखों से जुदा होते हुए पत्तों पे हँसते थे 
बड़े जिंदा नज़र थे जिनको मर जाने की जल्दी थी।

मैं साबित किस तरह करता कि हर आईना झूठा है
कई कमजर्फ चेहरों को उतर जाने की जल्दी थी।""",
    """क्यों मुकरना महफ़िल में, पहचानने से
   अच्छा है, हमें अनजान कर दो

नज़र लग जाती है, तारीफों से भी
  अच्छा है,हमें बदनाम कर दो

मेरे फ़ायदे से, आपका नुकसान हो तो 
अच्छा है, हमें कुर्बान कर दो

ढूंढ लेंगे खुशी, तकलीफ़ में भी 
अच्छा है, हमें परेशान कर दो

भर गई जगह अगर ज़मीन पर 
अच्छा है, हमें आसमान कर दो """,
    """किसी ने क्या खूब बोला है.
       मुझे बस तेरा वो साथ चाहिए....

माना मेरे जिंदगी की शुरुआत तुझसे नहीं हुई. 
पर उसके आखरी पल तक मुझे तुम्हारा साथ चाहिए.

तेरे कंधे पर सर रख कर जो मेरे चेहरे पे मुस्कान आती हैं,
मुझे हीरे मोती नहीं, बस मेरी वो मुस्कान चाहिए.

साज शिनगर क्या सजाएंगे मुझे तेरे साथ सज जाती है
मेरी रूह भी मुझे बस तेरा वो साथ चाहिए.
 
यूँ जब एक लम्हो,मुस्कुरा कर देखते हो तुम मुझे, मिल 
जाता है मुझे जहां, मुझे बस हमारा वो जहां चाहिए.

दिन महीने सालों के हिसाब नहीं आता मुझे, मुझे तो बस
 हर पल में तेरा साथ चाहिए.""",
    """सूरज सितारे चाँद मेरे साथ में रहे
जब तक तुम्हारे हाथ मेरे हाथ में रहे।

साँसों की तरह साथ रहे सारी जिंदगी
तुम ख्वाब से गए तो खयालात में रहे।

हर बूंद तीर बनके उतरती है रूह में
तन्हा मेरी तरह कोई बरसात में रहे

वो चाँद है तो होने का अपने सबूत दे
 महमान बनके छत पे मेरे साथ में रहे.

हर रंग हर मिजाज़ में पाया है आपको
मौसम तमाम आपकी खिदमात में रहे""",
    """खमोश लब है झुकी हैं पलकें दिलों में 
  उल्फत नई नई अभी तकल्लुफ है 
    गुफ्तगू अभी मुहब्बत नई नई है।

अभी न आएगी नींद तुमको अभी न हमको
गुरुं मिलेगा। अभी तो धडकेगा दिल जियादा 
अभी तो चाहत नई नई है।

जो खानदानी रईस है वो मिजाज रखते हैं 
नर्म अपना तुम्हारा लहजा बता रहा है 
 तुम्हारी दौलत नई नई है।

जरा सा कुदरत ने क्या नवाजा कि आके बैठे है
 पहली सफ मे अभी से उड़ने लगे हवा में अभी 
   तो शोहरत नई नई है।""",
    """मेरी पलकों पे तेरे ख्वाब सजा करते हैं 
तेरे आते ही दिल में साज बजा करते हैं

तेरी पलकें खुल तो फूल आँखें खोल दें 
 तेरे जाने पे गुलशन भी गिला करते हैं

अब अंधेरा मेरी गलियों से दूर रहता है 
 तेरी यादों के सदा दीप जला करते हैं

तेरी जुल्फ़ों की बात हो रही गली गली 
घने बादल भी तेरा कर्ज अदा करते हैं

तू पास हो तो खुदा की कमी महसूस ना हो
हम वो आशिक हैं जो बस तुम से वफ़ा करते हैं""",
    """अभी ना छोड़ के जाओ अभी तो शाम है
 तुम्हारे आने से दिल को जरा आराम है

मेरे नाकाम सफर का बड़ा चर्चा होगा 
हारे मुसाफिरों के जाने कितने नाम हैं

शाम साँचा में डूबी है बड़ी खामोश है 
चार दीवारों में बजता मेरा कलाम है

शहर के लोग हैं मशगुल खींचातानी में
 हमें मरने के सिवा और बड़े काम है

सुकून सब को अपने दायरों में मिलता है 
रात की गोद में मिलता मुझे आराम है""",
    """जिन्हें आदत नहीं साथ की 
उनके करीब जाते क्यों हो

जिन्हें प्यार से मतलब नही 
उनसे उम्मीद लगाते क्यों हो

जो आज़ाद रहना चाहते हैं
उन्हें रिश्तों में उलझाते क्यों हो

जो थक चुके हैं मोहब्बत से 
उन्हें फिर समझाते क्यों हो

ये दिल तुम्हारा है और ये 
गलतियां भी तुम्हारी हैं

जिन्हें तुम्हारी जरूरत नही 
उन्हें अपना बनाते क्यों हो""",
    """बदलते वक्त की रफ्तार देख 
उठा पर्दा नया किरदार देख

 कभी गाड़ी से निकल तू प्यारे
बिछा फुटपाथ पे ईमानदार देख

सब पे ऐसे ना भरोसा कर तू
बग़ल में छुपी हुई तलवार देख

कहीं एहसान में हक है छुपा
उन के एहसान की मिक़दार देख

किसी बद-कार ने भेजा है फूल 
गुलों में लिपटा हुआ खार देख

मैं तेरे दर पे कब से बैठा हूँ 
मेरी पलकों में बसा प्यार देख""",
    """जवानी पढ़कर किताब में गुज़र गए
 हसीन लम्हें ख़्वाब में गुज़र गए

खुलकर जीना उस बिन आया नहीं
 वो सामने से हिज़ाब में गुज़र गए

दो पल की खुशियाँ मिली साथ उसके
हिज्र फ़क़त अज़ाब में गुज़र गए

इस क़दर था घेरा उसकी यादों ने 
कि रात पीकर शराब में गुज़र गए

दर्द अपना इस जहाँ में समझे कौन
 वक़्त कितने इसी हिसाब में गुज़र गए""",
    """रुलाने के बाद मुझको, हंसाता भी बहुत है। 
वो मेरा इश्क है मुझे याद आता भी बहुत है।

कभी कहता है कि रिश्ता, अब खत्म हो चुका है, 
और जमाने में मुझे अपना बताता भी बहुत है।

वो भरता नही मांग में सिंदूर कभी लेकिन, 
सुहाग की हर रस्म को निभाता भी बहुत है।

जिसने रखे थे कभी सोलह उपवास मेरी खातिर, 
वो आजकल मुझसे पीछा छुड़ाता भी बहुत है।

मुझे देखने की खातिर जो तड़पता बहुत था, 
अब जाने क्यों वो नज़रें, चुराता भी बहुत है।

हर बात पर जिसके कभी, निकल आते थे आसूं, 
सुना है वो शख्स अब, मुस्कुराता भी बहुत है""",
    """कितनी पी कैसे कटी रात मुझे होश नहीं
 रात के साथ गई बात मुझे होश नहीं।

शब गुजार आया हूँ मस्जिद में के खाने में
 मुझसे पूँछो न सवालात मुझे होश नहीं।

मुझको ये भी नहीं मालूम कि जाना है कहाँ
  थाम ले कोई मेरा हाथ मुझे होश नहीं।

आँसुओं और शराबों में गुजर है अब तो 
मैंने कब देखी थी बरसात मुझे होश नहीं।

जाने क्या टूटा है पैमाना कि दिल है मेरा
 बिखरे-बिखरे हैं खयालात मुझे होश नहीं।

मैंने बेहोशी के आलम में बका है क्या क्या
 दिल पे लेना न कोई बात मुझे होश नहीं""",
    """सर झुकाओगे तो पत्थर देवता हो जाएगा।
इतना मत चाहो उसे वो बेवफा हो जाएगा।

हम भी दरिया है हमें अपना हुनर मालूम है। 
जिस तरफ भी चल पडेंगें रास्ता हो जाएगा।

कितनी सच्चाई से मुझसे जिंदगी ने कह दिया 
  तू नहीं मेरा तो कोई दूसरा हो जाएगा।

 मैं खुदा का नाम लेकर पी रहा हूं दोस्तों 
जहर भी इसमें अगर होगा दवा हो जाएगा।

  रूठ जाना तो मोहब्बत की अलामत है मगर
क्या खबर थी मुझसे वो इतना खफा हो जाएगा।""",
  ];
  List shayar = [
    """Tere Khayal Se Khud Ko Chhupa Ke Dekha Hai,
Dil-o-Najar Ko Rula-Rula Ke Dekha Hai,
Tu Nahi To Kuchh Bhi Nahi Hai Teri Kasam,
Maine Kuchh Pal Tujhe Bhula Ke Dekha Hai.""",
    """Hum Aapki Har Cheez Se Pyar Kar Lenge,
Aapki Har Baat Par Aitbaar Kar Lenge,
Bas Ek Bar Keh Do Ki Tum Sirf Mere Ho,
Hum Zindagi Bhar AapKa Intezaar Kar Lenge.""",
    """Jinka Milna Mukaddar Mein Likha Nahi Hota,
Unse Mohabbat Kasam Se Ba-Kamaal Hoti Hai.
Dil Se Poochho To Aaj Bhi Tum Mere Hi Ho,
Ye Aur Baat Hai Ki Kismat Dagaa Kar Gayi.""",
    """Har Tanha Raat Mein Ek Naam Yaad Aata Hai,
Kabhi Subhah To Kabhi Shaam Yaad Aata Hai,
Jab Sochte Hain Kar Lein Dobara Mohabbat,
Fir Pehli Mohabbat Ka Anzaam Yaad Aata Hai.""",
    """Humein Shayar Samajh Ke Yoon Najar Andaz Mat Kariye,
Najar Hum Fer Le To Husn Ka Baazar Gir Jayega.""",
    """Humari Haisiyat Ka Andaza Tum Ye Jaan Ke Laga Lo,
Hum Kabhi Unke Nahi Hote Jo Har Kisi Ke Ho Gaye.""",
    """Iss Se Zyada Tujhe Aur Kitna Qareeb Laaun Main,
Ki Tujhe Dil Mein Rakh Kar Bhi Mera Dil Nahi Bharta.""",
    """Haqikat Na Sahi Tum Khwab Bankar Mila Karo,
Bhatke Musafir Ko Chaandani Raat Bankar Mila Karo.""",
    """Bhare Bazaar Se Aksar Main Khali Haath Aaya Hoon,
Kabhi Khwahish Nahi Hoti Kabhi Paise Nahi Hote.""",
    """Talab Karein To Main Apni Aankhein Bhi Unhe De Du,
Magar Ye Log Meri Aankhon Ke Khwab Maangte Hain""",
    """Ye Zindagi Hasin Hai Iss Se Pyar Karo,
Abhi Hai Raat To Subah Ka Intezar Karo,
Wo Pal Bhi Ayega Jiski Khwahish Hai Aapko,
Rab Par Rakho Bharosa Waqt Par Aitbar Karo.""",
    """Itna Betaab Na Ho Mujhse Bichhadne Ke Liye,
Tujhe Aankhon Se Nahi Mere Dil Se Juda Hona Hai.""",
    """Bahut Dard Hai Ai Jaan-e-Adaa Teri Mohabbat Mein,
Kaise Keh Doon Ki Tujhe Wafa Nibhani Nahi Aati.""",
    """Kitna Lutf Le Rahein Hain Log Mere Dard-o-Gham Ka,
Ai Ishq Dekh Tu Ne To Mera Tamaasha Hi Bana Diya.""",
    """Tera Pyar Paane Ke Liye
Maine Kitna Intezar Kiya,
Aur Uss Intezar Mein Na Jaane
Kitno Se Pyar Kiya.""",
    """Tera Khayal Dil Se Mitaya Nahi Abhi,
BeWafa Maine Tujhko Bhulaya Nahi Abhi.""",
    """Humse Na Kariye Baatein Yoon Berukhi Se Sanam,
Hone Lage Ho Kuchh-Kuchh Bewafa Se Tum.""",
    """Fariyad Kar Rahi Hai Ye Tarsi Huyi Nigaah,
Dekhe Huye Kisi Ko Zamana Gujar Gaya.""",
    """Ye Keh-Keh Ke Hum Dil Ko Samjha Rahe Hain,
Wo Ab Chal Chuke Hai Wo Ab Aa Rahe Hain.""",
    """Raah Takte Huye Jab Thak Gayi Meri Aankhein,
Fir Tujhe Dhoondne Meri Aankh Ke Aansoo Nikle.""",
    """Mujhe Maloom Hai Tumne Bahut Barsaat Dekhi Hai,
Magar Meri Inhi Aankhon Se Sawan Haar Jaata Hai.""",
  ];
  List rahatindori = [
    """अब ना मैं हूँ, ना बाकी हैं ज़माने मेरे​,
फिर भी मशहूर हैं शहरों में फ़साने मेरे​,
ज़िन्दगी है तो नए ज़ख्म भी लग जाएंगे​,
अब भी बाकी हैं कई दोस्त पुराने मेरे।""",
    """विश्वास बन के लोग ज़िन्दगी में आते है,
ख्वाब बन के आँखों में समा जाते है,
पहले यकीन दिलाते है की वो हमारे है,
फिर न जाने क्यों बदल जाते है""",
    """सूरज, सितारे, चाँद मेरे साथ में रहें,
जब तक तुम्हारे हाथ मेरे हाथ में रहें,
शाखों से टूट जाए वो पत्ते नहीं हैं हम,
आंधी से कोई कह दे की औकात में रहें।""",
    """लोग हर मोड़ पे रुक-रुक के सँभलते क्यूँ हैं,
इतना डरते हैं तो फिर घर से निकलते क्यूँ हैं।""",
    """मेरी सांसों में समाया भी बहुत लगता है,
और वही शख्स पराया भी बहुत लगता है,
उससे मिलने की तमन्ना भी बहुत है लेकिन
आने जाने में किराया भी बहुत लगता है।""",
    """आँख में पानी रखो होंटों पे चिंगारी रखो,
ज़िंदा रहना है तो तरकीबें बहुत सारी रखो,
एक ही नद्दी के हैं ये दो किनारे दोस्तो
दोस्ताना ज़िंदगी से मौत से यारी रखो।""",
    """ये सहारा जो नहीं हो तो परेशान हो जाएँ,
मुश्किलें जान ही लेलें अगर आसान हो जाएँ,
ये जो कुछ लोग फरिश्तों से बने फिरते हैं,
मेरे हत्थे कभी चढ़ जाएँ तो इंसान हो जाएँ।""",
    """फैसला जो कुछ भी हो, हमें मंजूर होना चाहिए,
जंग हो या इश्क हो, भरपूर होना चाहिए,
भूलना भी हैं, जरुरी याद रखने के लिए,
पास रहना है, तो थोडा दूर होना चाहिए।""",
    """तुम ही सनम हो, तुम ही खुदा हो,
वफा भी तुम हो तुम, तुम ही जफा हो,
सितम करो तो मिसाल कर दो,
करम करो तो कमाल कर दो।""",
    """धनक है, रंग है, एहसास है की खुशबू है,
चमक है, नूर है, मुस्कान है के आँसू है,
मैं नाम क्या दूं उजालों की इन लकीरों को
खनक है, रक्स है, आवाज़ है की जादू है।""",
    """प्यार के उजाले में गम का अँधेरा क्यों है,
जिसको हम चाहे वही रुलाता क्यों है,
मेरे रब्बा अगर वो मेरा नसीब नहीं तो,
ऐसे लोगो से हमे मिलता क्यों है।""",
    """जो छेड़ दे कोई नगमा तो खिल उठें तारे,
हवा में उड़ने लगी रोशनी के फव्वारे,
आप सुनते ही नजरों में तैर जाते हैं,
दुआएं करते हुए मस्जिदों के मीनारें।""",
    """अजीब लोग हैं मेरी तलाश में मुझको,
वहाँ पर ढूंढ रहे हैं जहाँ नहीं हूँ मैं,
मैं आईनों से तो मायूस लौट आया था,
मगर किसी ने बताया बहुत हसीं हूँ मैं।""",
    """शहरों में तो बारुदों का मौसम है,
गांव चलो अमरूदों का मौसम है,
सूख चुके हैं सारे फूल फरिश्तों के,
बागों में नमरूदों का मौसम है।""",
    """लू भी चलती थी तो बादे-शबा कहते थे,
पांव फैलाये अंधेरो को दिया कहते थे,
उनका अंजाम तुझे याद नही है शायद,
और भी लोग थे जो खुद को खुदा कहते थे।""",
    """तुम्हें किसी की कहाँ है परवाह,
तुम्हारे वादे का क्या भरोसा,
जो पल की कह दो तो कल बना दो,
जो कल की कह दो तो साल कर दो।""",
    """जा के ये कह दो कोई शोलो से, चिंगारी से
फूल इस बार खिले है बड़ी तय्यारी से,
बादशाहों से भी फेंके हुए सिक्के ना लिए
हमने ख़ैरात भी माँगी है तो ख़ुद्दारी से।""",
    """कम नहीं हैं मुझे हमदमों से,
मेरा याराना है इन गमों से,
मैं खुशी को अगर मुंह लगा लूं,
मेरे यारों का दिल टूट जाए।""",
    """यही ईमान लिखते हैं, यही ईमान पढ़ते हैं,
हमें कुछ और मत पढवाओ, हम कुरान पढ़ते हैं,
यहीं के सारे मंजर हैं, यहीं के सारे मौसम हैं,
वो अंधे हैं, जो इन आँखों में पाकिस्तान पढ़ते हैं।""",
  ];
  List mirzagalib = [
    """ज़माना सख़्त कम-आज़ार है ब-जान-ए-असद 
वगर्ना हम तो तवक़्क़ो ज़ियादा रखते हैं 

तन-ए-ब-बंद-ए-हवस दर नदादा रखते हैं 
दिल-ए-ज़-कार-ए-जहाँ ऊफ़्तादा रखते हैं 

तमीज़-ए-ज़िश्ती-ओ-नेकी में लाख बातें हैं 
ब-अक्स-ए-आइना यक-फ़र्द-ए-सादा रखते हैं 

ब-रंग-ए-साया हमें बंदगी में है तस्लीम 
कि दाग़-ए-दिल ब-जाबीन-ए-कुशादा रखते हैं 

ब-ज़ाहिदाँ रग-ए-गर्दन है रिश्ता-ए-ज़ुन्नार 
सर-ए-ब-पा-ए-बुत-ए-ना-निहादा रखते हैं 

मुआफ़-ए-बे-हूदा-गोई हैं नासेहान-ए-अज़ीज़ 
दिल-ए-ब-दस्त-ए-निगारे नदादा रखते हैं 

ब-रंग-ए-सब्ज़ा अज़ीज़ान-ए-बद-ज़बान यक-दस्त 
हज़ार तेग़-ए-ब-ज़हर-आब-दादा रखते हैं 

अदब ने सौंपी हमें सुर्मा-साइ-ए-हैरत 
ज़-बन-ए-बस्ता-ओ-चश्म-ए-कुशादा रखते हैं 
Mirza Ghalib""",
    """ज़िक्र मेरा ब-बदी भी उसे मंज़ूर नहीं 
ग़ैर की बात बिगड़ जाए तो कुछ दूर नहीं 

वादा-ए-सैर-ए-गुलिस्ताँ है ख़ुशा ताले-ए-शौक़ 
मुज़्दा-ए-क़त्ल मुक़द्दर है जो मज़कूर नहीं 

शाहिद-ए-हस्ती-ए-मुतलक़ की कमर है आलम 
लोग कहते हैं कि है पर हमें मंज़ूर नहीं 

क़तरा अपना भी हक़ीक़त में है दरिया लेकिन 
हम को तक़लीद-ए-तुनुक-ज़र्फ़ी-ए-मंसूर नहीं 

हसरत ऐ ज़ौक़-ए-ख़राबी कि वो ताक़त न रही 
इश्क़-ए-पुर-अरबदा की गूँ तन-ए-रंजूर नहीं 

मैं जो कहता हूँ कि हम लेंगे क़यामत में तुम्हें 
किस रऊनत से वो कहते हैं कि हम हूर नहीं 

ज़ुल्म कर ज़ुल्म अगर लुत्फ़ दरेग़ आता हो 
तू तग़ाफ़ुल में किसी रंग से मअज़ूर नहीं 

साफ़ दुर्दी-कश-ए-पैमाना-ए-जम हैं हम लोग 
वाए वो बादा कि अफ़्शुर्दा-ए-अंगूर नहीं 

हूँ ज़ुहूरी के मुक़ाबिल में ख़िफ़ाई 'ग़ालिब' 
मेरे दावे पे ये हुज्जत है कि मशहूर नहीं 
Mirza Ghalib""",
    """ज़िक्र उस परी-वश का और फिर बयाँ अपना 
बन गया रक़ीब आख़िर था जो राज़-दाँ अपना 

मय वो क्यूँ बहुत पीते बज़्म-ए-ग़ैर में या रब 
आज ही हुआ मंज़ूर उन को इम्तिहाँ अपना 

मंज़र इक बुलंदी पर और हम बना सकते 
अर्श से उधर होता काश के मकाँ अपना 

दे वो जिस क़दर ज़िल्लत हम हँसी में टालेंगे 
बारे आश्ना निकला उन का पासबाँ अपना 

दर्द-ए-दिल लिखूँ कब तक जाऊँ उन को दिखला दूँ 
उँगलियाँ फ़िगार अपनी ख़ामा ख़ूँ-चकाँ अपना 

घिसते घिसते मिट जाता आप ने अबस बदला 
नंग-ए-सज्दा से मेरे संग-ए-आस्ताँ अपना 

ता करे न ग़म्माज़ी कर लिया है दुश्मन को 
दोस्त की शिकायत में हम ने हम-ज़बाँ अपना 

हम कहाँ के दाना थे किस हुनर में यकता थे 
बे-सबब हुआ 'ग़ालिब' दुश्मन आसमाँ अपना 
Mirza Ghalib""",
    """तपिश से मेरी वक़्फ़-ए-कशमकश हर तार-ए-बिस्तर है 
मिरा सर रंज-ए-बालीं है मिरा तन बार-ए-बिस्तर है 

सरिश्क-ए-सर ब-सहरा दादा नूर-उल-ऐन-ए-दामन है 
दिल-ए-बे-दस्त-ओ-पा उफ़्तादा बर-ख़ुरदार-ए-बिस्तर है 

ख़ुशा इक़बाल-ए-रंजूरी अयादत को तुम आए हो 
फ़रोग-ए-शम-ए-बालीं फ़रोग-ए-शाम-ए-बालीँ है 

ब-तूफ़ाँ-गाह-ए-जोश-ए-इज़्तिराब-ए-शाम-ए-तन्हाई 
शुआ-ए-आफ़्ताब-ए-सुब्ह-ए-महशर तार-ए-बिस्तर है 

अभी आती है बू बालिश से उस की ज़ुल्फ़-ए-मुश्कीं की 
हमारी दीद को ख़्वाब-ए-ज़ुलेख़ा आर-ए-बिस्तर है 

कहूँ क्या दिल की क्या हालत है हिज्र-ए-यार में ग़ालिब 
कि बेताबी से हर-यक तार-ए-बिस्तर ख़ार-ए-बिस्तर है 
Mirza Ghalib""",
    """तस्कीं को हम न रोएँ जो ज़ौक़-ए-नज़र मिले 
हूरान-ए-ख़ुल्द में तिरी सूरत मगर मिले 

अपनी गली में मुझ को न कर दफ़्न बाद-ए-क़त्ल 
मेरे पते से ख़ल्क़ को क्यूँ तेरा घर मिले 

साक़ी-गरी की शर्म करो आज वर्ना हम 
हर शब पिया ही करते हैं मय जिस क़दर मिले 

तुझ से तो कुछ कलाम नहीं लेकिन ऐ नदीम 
मेरा सलाम कहियो अगर नामा-बर मिले 

तुम को भी हम दिखाएँ कि मजनूँ ने क्या किया 
फ़ुर्सत कशाकश-ए-ग़म-ए-पिन्हाँ से गर मिले 

लाज़िम नहीं कि ख़िज़्र की हम पैरवी करें 
जाना कि इक बुज़ुर्ग हमें हम-सफ़र मिले 

ऐ साकिनान-ए-कूचा-ए-दिलदार देखना 
तुम को कहीं जो 'ग़ालिब'-ए-आशुफ़्ता-सर मिले 
Mirza Ghalib""",
    """तेरे तौसन को सबा बाँधते हैं 
हम भी मज़मूँ की हवा बाँधते हैं 

आह का किस ने असर देखा है 
हम भी एक अपनी हवा बाँधते हैं 

तेरी फ़ुर्सत के मुक़ाबिल ऐ उम्र 
बर्क़ को पा-ब-हिना बाँधते हैं 

क़ैद-ए-हस्ती से रिहाई मा'लूम 
अश्क को बे-सर-ओ-पा बाँधते हैं 

नश्शा-ए-रंग से है वाशुद-ए-गुल 
मस्त कब बंद-ए-क़बा बाँधते हैं 

ग़लती-हा-ए-मज़ामीं मत पूछ 
लोग नाले को रसा बाँधते हैं 

अहल-ए-तदबीर की वामांदगियाँ 
आबलों पर भी हिना बाँधते हैं 

सादा पुरकार हैं ख़ूबाँ 'ग़ालिब' 
हम से पैमान-ए-वफ़ा बाँधते हैं 

पाँव में जब वो हिना बाँधते हैं 
मेरे हाथों को जुदा बाँधते हैं 

हुस्न-ए-अफ़्सुर्दा-दिल-हा-रंगीं 
शौक़ को पा-ब-हिना बाँधते हैं 

क़ैद में भी है असीरी आज़ाद 
चश्म-ए-ज़ंजीर को वा बाँधते हैं 

शैख़-जी का'बे का जाना मा'लूम 
आप मस्जिद में गधा बाँधते हैं 

किस का दिल ज़ुल्फ़ से भागा कि 'असद' 
दस्त-ए-शाना ब-क़ज़ा बाँधते हैं 

तेरे बीमार पे हैं फ़रियादी 
वो जो काग़ज़ में दवा बाँधते हैं 
Mirza Ghalib""",
    """तेरे तौसन को सबा बाँधते हैं 
हम भी मज़मूँ की हवा बाँधते हैं 

आह का किस ने असर देखा है 
हम भी एक अपनी हवा बाँधते हैं 

तेरी फ़ुर्सत के मुक़ाबिल ऐ उम्र 
बर्क़ को पा-ब-हिना बाँधते हैं 

क़ैद-ए-हस्ती से रिहाई मा'लूम 
अश्क को बे-सर-ओ-पा बाँधते हैं 

नश्शा-ए-रंग से है वाशुद-ए-गुल 
मस्त कब बंद-ए-क़बा बाँधते हैं 

ग़लती-हा-ए-मज़ामीं मत पूछ 
लोग नाले को रसा बाँधते हैं 

अहल-ए-तदबीर की वामांदगियाँ 
आबलों पर भी हिना बाँधते हैं 

सादा पुरकार हैं ख़ूबाँ 'ग़ालिब' 
हम से पैमान-ए-वफ़ा बाँधते हैं 

पाँव में जब वो हिना बाँधते हैं 
मेरे हाथों को जुदा बाँधते हैं 

हुस्न-ए-अफ़्सुर्दा-दिल-हा-रंगीं 
शौक़ को पा-ब-हिना बाँधते हैं 

क़ैद में भी है असीरी आज़ाद 
चश्म-ए-ज़ंजीर को वा बाँधते हैं 

शैख़-जी का'बे का जाना मा'लूम 
आप मस्जिद में गधा बाँधते हैं 

किस का दिल ज़ुल्फ़ से भागा कि 'असद' 
दस्त-ए-शाना ब-क़ज़ा बाँधते हैं 

तेरे बीमार पे हैं फ़रियादी 
वो जो काग़ज़ में दवा बाँधते हैं 
Mirza Ghalib""",
    """तू दोस्त कसू का भी सितमगर न हुआ था 
औरों पे है वो ज़ुल्म कि मुझ पर न हुआ था 

छोड़ा मह-ए-नख़शब की तरह दस्त-ए-क़ज़ा ने 
ख़ुर्शीद हुनूज़ उस के बराबर न हुआ था 

तौफ़ीक़ ब-अंदाज़ा-ए-हिम्मत है अज़ल से 
आँखों में है वो क़तरा कि गौहर न हुआ था 

जब तक कि न देखा था क़द-ए-यार का आलम 
मैं मो'तक़िद-ए-फ़ित्ना-ए-महशर न हुआ था 

मैं सादा-दिल आज़ुर्दगी-ए-यार से ख़ुश हूँ 
या'नी सबक़-ए-शौक़ मुकर्रर न हुआ था 

दरिया-ए-मआसी तुनुक-आबी से हुआ ख़ुश्क 
मेरा सर-ए-दामन भी अभी तर न हुआ था 

जारी थी 'असद' दाग़-ए-जिगर से मिरी तहसील 
आतिश-कदा जागीर-ए-समुंदर न हुआ था 
Mirza Ghalib""",
    """तुम अपने शिकवे की बातें न खोद खोद के पूछो 
हज़र करो मिरे दिल से कि इस में आग दबी है 

दिला ये दर्द-ओ-अलम भी तो मुग़्तनिम है कि आख़िर 
न गिर्या-ए-सहरी है न आह-ए-नीम-शबी है 

नज़र ब-नक़्स-ए-गदायाँ कमाल-ए-बे-अदबी है 
कि ख़ार-ए-ख़ुश्क को भी दावा-ए-चमन-नसबी है 

हुआ विसाल से शौक़-ए-दिल-ए-हरीस ज़ियादा 
लब-ए-क़दह पे कफ़-ए-बादा जोश-ए-तिश्ना-लबी है 

ख़ुशा वो दिल कि सरापा तिलिस्म-ए-बे-ख़बरी हो 
जुनून ओ यास ओ अलम रिज़्क़-ए-मुद्दआ-तलबी है 

चमन में किस के ये बरहम हुइ है बज़्म-ए-तमाशा 
कि बर्ग बर्ग-ए-समन शीशा रेज़ा-ए-हलबी है 

इमाम-ए-ज़ाहिर-ओ-बातिन अमीर-ए-सूरत-ओ-मअनी 
'अली' वली असदुल्लाह जानशीन-ए-नबी है 
Mirza Ghalib""",
    """उस बज़्म में मुझे नहीं बनती हया किए 
बैठा रहा अगरचे इशारे हुआ किए 

दिल ही तो है सियासत-ए-दरबाँ से डर गया 
मैं और जाऊँ दर से तिरे बिन सदा किए 

रखता फिरूँ हूँ ख़िर्क़ा ओ सज्जादा रहन-ए-मय 
मुद्दत हुई है दावत आब-ओ-हवा किए 

बे-सर्फ़ा ही गुज़रती है हो गरचे उम्र-ए-ख़िज़्र 
हज़रत भी कल कहेंगे कि हम क्या किया किए 

मक़्दूर हो तो ख़ाक से पूछूँ कि ऐ लईम 
तू ने वो गंज-हा-ए-गराँ-माया क्या किए 

किस रोज़ तोहमतें न तराशा किए अदू 
किस दिन हमारे सर पे न आरे चला किए 

सोहबत में ग़ैर की न पड़ी हो कहीं ये ख़ू 
देने लगा है बोसा बग़ैर इल्तिजा किए 

ज़िद की है और बात मगर ख़ू बुरी नहीं 
भूले से उस ने सैकड़ों वा'दे वफ़ा किए 

'ग़ालिब' तुम्हीं कहो कि मिलेगा जवाब क्या 
माना कि तुम कहा किए और वो सुना किए 
Mirza Ghalib""",
    """वाँ पहुँच कर जो ग़श आता पए-हम है हम को 
सद-रह आहंग-ए-ज़मीं बोस-ए-क़दम है हम को 

दिल को मैं और मुझे दिल महव-ए-वफ़ा रखता है 
किस क़दर ज़ौक़-ए-गिरफ़्तारी-ए-हम है हम को 

ज़ोफ़ से नक़्श-ए-प-ए-मोर है तौक़-ए-गर्दन 
तिरे कूचे से कहाँ ताक़त-ए-रम है हम को 

जान कर कीजे तग़ाफ़ुल कि कुछ उम्मीद भी हो 
ये निगाह-ए-ग़लत-अंदाज़ तो सम है हम को 

रश्क-ए-हम-तरही ओ दर्द-ए-असर-ए-बांग-ए-हज़ीं 
नाला-ए-मुर्ग़-ए-सहर तेग़-ए-दो-दम है हम को 

सर उड़ाने के जो वादे को मुकर्रर चाहा 
हँस के बोले कि तिरे सर की क़सम है हम को 

दिल के ख़ूँ करने की क्या वजह व-लेकिन नाचार 
पास-ए-बे-रौनक़ी-ए-दीदा अहम है हम को 

तुम वो नाज़ुक कि ख़मोशी को फ़ुग़ाँ कहते हो 
हम वह आजिज़ कि तग़ाफ़ुल भी सितम है हम को 

लखनऊ आने का बाइस नहीं खुलता यानी 
हवस-ए-सैर-ओ-तमाशा सो वह कम है हम को 

मक़्ता-ए-सिलसिला-ए-शौक़ नहीं है ये शहर 
अज़्म-ए-सैर-ए-नजफ़-ओ-तौफ़-ए-हरम है हम को 

लिए जाती है कहीं एक तवक़्क़ो 'ग़ालिब' 
जादा-ए-रह कशिश-ए-काफ़-ए-करम है हम को 

अब्र रोता है कि बज़्म-ए-तरब आमादा करो 
बर्क़ हँसती है कि फ़ुर्सत कोई दम है हम को 
Mirza Ghalib""",
    """वारस्ता उस से हैं कि मोहब्बत ही क्यूँ न हो 
कीजे हमारे साथ अदावत ही क्यूँ न हो 

छोड़ा न मुझ में ज़ोफ़ ने रंग इख़्तिलात का 
है दिल पे बार नक़्श-ए-मोहब्बत ही क्यूँ न हो 

है मुझ को तुझ से तज़्किरा-ए-ग़ैर का गिला 
हर-चंद बर-सबील-ए-शिकायत ही क्यूँ न हो 

पैदा हुई है कहते हैं हर दर्द की दवा 
यूँ हो तो चारा-ए-ग़म-ए-उल्फ़त ही क्यूँ न हो 

डाला न बे-कसी ने किसी से मुआ'मला 
अपने से खींचता हूँ ख़जालत ही क्यूँ न हो 

है आदमी बजाए ख़ुद इक महशर-ए-ख़याल 
हम अंजुमन समझते हैं ख़ल्वत ही क्यूँ न हो 

हंगामा-ए-ज़बूनी-ए-हिम्मत है इंफ़िआल 
हासिल न कीजे दहर से इबरत ही क्यूँ न हो 

वारस्तगी बहाना-ए-बेगानगी नहीं 
अपने से कर न ग़ैर से वहशत ही क्यूँ न हो 

मिटता है फ़ौत-ए-फ़ुर्सत-ए-हस्ती का ग़म कोई 
उम्र-ए-अज़ीज़ सर्फ़-ए-इबादत ही क्यूँ न हो 

उस फ़ित्ना-ख़ू के दर से अब उठते नहीं 'असद' 
उस में हमारे सर पे क़यामत ही क्यूँ न हो 
Mirza Ghalib""",
    """वो फ़िराक़ और वो विसाल कहाँ 
वो शब-ओ-रोज़ ओ माह-ओ-साल कहाँ 

फ़ुर्सत-ए-कारोबार-ए-शौक़ किसे 
ज़ौक़-ए-नज़्ज़ारा-ए-जमाल कहाँ 

दिल तो दिल वो दिमाग़ भी न रहा 
शोर-ए-सौदा-ए-ख़त्त-ओ-ख़ाल कहाँ 

थी वो इक शख़्स के तसव्वुर से 
अब वो रानाई-ए-ख़याल कहाँ 

ऐसा आसाँ नहीं लहू रोना 
दिल में ताक़त जिगर में हाल कहाँ 

हम से छूटा क़िमार-ख़ाना-ए-इश्क़ 
वाँ जो जावें गिरह में माल कहाँ 

फ़िक्र-ए-दुनिया में सर खपाता हूँ 
मैं कहाँ और ये वबाल कहाँ 

मुज़्महिल हो गए क़वा ग़ालिब 
वो अनासिर में ए'तिदाल कहाँ 

बोसे में वो मुज़ाइक़ा न करे 
पर मुझे ताक़त-ए-सवाल कहाँ 

फ़लक-ए-सिफ़्ला बे-मुहाबा है 
इस सितम-गर को इंफ़िआल कहाँ 
Mirza Ghalib""",
    """वो मिरी चीन-ए-जबीं से ग़म-ए-पिन्हाँ समझा 
राज़-ए-मक्तूब ब-बे-रब्ती-ए-उनवाँ समझा 

यक अलिफ़ बेश नहीं सैक़ल-ए-आईना हनूज़ 
चाक करता हूँ मैं जब से कि गरेबाँ समझा 

शरह-ए-असबाब-ए-गिरफ़्तारी-ए-ख़ातिर मत पूछ 
इस क़दर तंग हुआ दिल कि मैं ज़िंदाँ समझा 

बद-गुमानी ने न चाहा उसे सरगर्म-ए-ख़िराम 
रुख़ पे हर क़तरा अरक़ दीदा-ए-हैराँ समझा 

इज्ज़ से अपने ये जाना कि वो बद-ख़ू होगा 
नब्ज़-ए-ख़स से तपिश-ए-शोला-ए-सोज़ाँ समझा 

सफ़र-ए-इश्क़ में की ज़ोफ़ ने राहत-तलबी 
हर क़दम साए को मैं अपने शबिस्ताँ समझा 

था गुरेज़ाँ मिज़ा-ए-यार से दिल ता दम-ए-मर्ग 
दफ़-ए-पैकान-ए-क़ज़ा इस क़दर आसाँ समझा 

दिल दिया जान के क्यूँ उस को वफ़ादार 'असद' 
ग़लती की कि जो काफ़िर को मुसलमाँ समझा 

हम ने वहशत-कदा-ए-बज़्म-ए-जहाँ में जूँ शम्अ' 
शो'ला-ए-इश्क़ को अपना सर-ओ-सामाँ समझा 
Mirza Ghalib""",
    """वुसअत-ए-सई-ए-करम देख कि सर-ता-सर-ए-ख़ाक 
गुज़रे है आबला-पा अब्र-ए-गुहर-बार हुनूज़ 

यक-क़लम काग़ज़-ए-आतिश-ज़दा है सफ़्हा-ए-दश्त 
नक़्श-ए-पा में है तब-ए-गर्मी-ए-रफ़्तार हुनूज़ 

दाग़-ए-अतफ़ाल है दीवाना ब-कोहसार हुनूज़ 
ख़ल्वत-ए-संग में है नाला तलब-गार हुनूज़ 

ख़ाना है सैल से ख़ू-कर्दा-ए-दीदार हुनूज़ 
दूरबीं दर-ज़दा है रख़्ना-ए-दीवार हुनूज़ 

आई यक-उम्र से मअज़ूर-ए-तमाशा नर्गिस 
चश्म-ए-शबनम में न टूटा मिज़ा-ए-ख़ार हुनूज़ 

क्यूँ हुआ था तरफ़-ए-आबला-ए-पा या-रब 
जादा है वा-शुदन-ए-पेचिश-ए-तूमार हुनूज़ 

हों ख़मोशी-ए-चमन हसरत-ए-दीदार 'असद' 
मिज़ा है शाना-कश-ए-तुर्रा-ए-गुफ़्तार हुनूज़ 
Mirza Ghalib""",
    """याद है शादी में भी हंगामा-ए-या-रब मुझे 
सुब्हा-ए-ज़ाहिद हुआ है ख़ंदा ज़ेर-ए-लब मुझे 

है कुशाद-ए-ख़ातिर-ए-वा-बस्ता दर रहन-ए-सुख़न 
था तिलिस्म-ए-क़ुफ़्ल-ए-अबजद ख़ाना-ए-मकतब मुझे 

या रब इस आशुफ़्तगी की दाद किस से चाहिए 
रश्क आसाइश पे है ज़िंदानियों की अब मुझे 

तब्अ' है मुश्ताक़-ए-लज़्ज़त-हा-ए-हसरत क्या करूँ 
आरज़ू से है शिकस्त-ए-आरज़ू मतलब मुझे 

दिल लगा कर आप भी 'ग़ालिब' मुझी से हो गए 
इश्क़ से आते थे माने मीरज़ा साहब मुझे 
Mirza Ghalib""",
    """यक-ज़र्रा-ए-ज़मीं नहीं बे-कार बाग़ का 
याँ जादा भी फ़तीला है लाले के दाग़ का 

बे-मय किसे है ताक़त-ए-आशोब-ए-आगही 
खींचा है इज्ज़-ए-हौसला ने ख़त अयाग़ का 

बुलबुल के कारोबार पे हैं ख़ंदा-हा-ए-गुल 
कहते हैं जिस को इश्क़ ख़लल है दिमाग़ का 

ताज़ा नहीं है नश्शा-ए-फ़िक्र-ए-सुख़न मुझे 
तिर्याकी-ए-क़दीम हूँ दूद-ए-चराग़ का 

सौ बार बंद-ए-इश्क़ से आज़ाद हम हुए 
पर क्या करें कि दिल ही अदू है फ़राग़ का 

बे-ख़ून-ए-दिल है चश्म में मौज-ए-निगह ग़ुबार 
ये मय-कदा ख़राब है मय के सुराग़ का 

बाग़-ए-शगुफ़्ता तेरा बिसात-ए-नशात-ए-दिल 
अब्र-ए-बहार ख़ुम-कद किस के दिमाग़ का? 

जोश-ए-बहार-ए-कुल्फ़त-ए-नज़्ज़ारा है 'असद' 
है अब्र पम्बा रौज़न-ए-दीवार-ए-बाग़ का 
Mirza Ghalib""",
    """ये हम जो हिज्र में दीवार-ओ-दर को देखते हैं 
कभी सबा को कभी नामा-बर को देखते हैं 

वो आए घर में हमारे ख़ुदा की क़ुदरत है 
कभी हम उन को कभी अपने घर को देखते हैं 

नज़र लगे न कहीं उस के दस्त-ओ-बाज़ू को 
ये लोग क्यूँ मिरे ज़ख़्म-ए-जिगर को देखते हैं 

तिरे जवाहिर-ए-तुर्फ़-ए-कुलह को क्या देखें 
हम औज-ए-ताला-ए-लाला-ओ-गुहर को देखते हैं 
Mirza Ghalib""",
  ];
  List ghazalgeet = [
    """लड़ रहे साँस से ज़िंदगी के लिए
दिल जलाते रहे रौशनी के लिए

ग़म उठाता रहा उम्र भर फ़ाएदा
चंद पल की हँसी और ख़ुशी के लिए

साहिलों से कभी नाख़ुदा से कभी
हम ने की दोस्ती इक नदी के लिए

है बड़ा ही कठिन काम दुनिया में ये
ढूँढना आदमी आदमी के लिए

ये बिछड़ते हुए कह गई दिल-रुबा
तुम बने हो मियाँ शायरी के लिए

वक़्त की थी कमी गर्दिशों के थे दिन
वक़्त देना पड़ा हर किसी के लिए

याद है ना तुम्हें बात ‘गुस्ताख़’ की
बुज़दिली चाहिए ख़ुद-कुशी के लिए 
Rohit Gustakh""",
    """देखा उसको धड़का दिल
तोड़ क़फ़स फिर निकला दिल

सारी दुनिया दुनिया है
अपना है तो उसका दिल

पागल है दीवाना है
सोलह बरस का लड़का दिल

और किसी की सुनता नहीं
बात दिलों की लिखता दिल

इश्क़ करेगा ये कैसे
हालातों का मारा दिल

ख़ूब दुआएँ दी उसको
करता भी क्या टूटा दिल 
Rohit Gustakh""",
    """हर पल इक पागल की ख़ातिर
ख़्वाब सजाये कल की ख़ातिर

जिस पल में जीनी थीं सदियाँ
आया वो इक पल की ख़ातिर

बेच गिटार हुआ दीवाना
तेरी इस पायल की ख़ातिर

ले आये दिल बुनकर अपना
सर्दी में कम्बल की ख़ातिर

ठुकरा दी है जग की दौलत
इक तेरे आँचल की ख़ातिर

ग़ालिब की गलियों में हम भी
भटके नज़्म ग़ज़ल की ख़ातिर

क़ैद किया वारिद को हमने
आज तिरे काजल की ख़ातिर

रहती है अनबन पेड़ों में
उस मीठी कोयल की ख़ातिर

मोड़ लिया मुँह सब रागों से
नदियों की कल कल की ख़ातिर

ज़ुल्म सहे कीचड़ के हमने
उस महबूब कमल की ख़ातिर

किसको अपना समझे धरती
जोगिन है बादल की ख़ातिर

आज हुई दिल से गुस्ताख़ी
छोड़ दिया सब कल की ख़ातिर 
Rohit Gustakh""",
    """आबरू को मेरी जब उछाला गया
होश मुझसे न मेरा सँभाला गया

पहले हमसे निकाले गए काम सब
फिर दिलों से हमें भी निकाला गया

जुगनुओं से भला क्यूँ शिकायत करें
हाथ से चाँद का जब उजाला गया 
Rohit Gustakh""",
    """हरे पत्तों ने समझा है जड़ों का दुख
वगरना कौन समझे हम बड़ों का दुख

महल की ज़द पे पैसा रक़्स करता है
ग़रीबी ने चखा बस झोपड़ों का दुख

नए कमरे की सीलन से खुला मुझपर
घुटन की चाक पर बैठे घड़ों का दुख

के बेवा के लिए ज़ंजीर ज़ेवर है 
सुहागन ही बताएगी कड़ों का दुख

जिन्होंने मौत देखी मर चुके समझो
नहीं आया सुख़न तक आँकड़ों का दुख 
Neeraj Neer""",
    """जाँ से प्यारा जा चुका है तालियाँ बजती रहे
मुझको मारा जा चुका है तालियाँ बजती रहे

सामने बैठा है जो वो 'नीर' कोई और है
वो तुम्हारा जा चुका है तालियाँ बजती रहे

आप बेहद खूबसूरत हैं मगर समझें ज़रा
दिल सँवारा जा चुका है तालियाँ बजती रहे

उनपे लानत है जिन्होंने लाश पर नज़्में कही
सर उतारा जा चुका है तालियाँ बजती रहे

और शकुनी के जहां में ज़िंदगी बस इक जुआ
दाव हारा जा चुका है तालियाँ बजती रहे

इसका मतलब है कि हम दिल से निकाले जा चुके
घर *बुहारा जा चुका है तालियाँ बजती रहे
बुहारना - झाड़ू से फ़र्स आदि साफ़ करना 

'नीर' कपड़ो का उतरना लाज़मी है कोठे पर
मन उतारा जा चुका है तालियाँ बजती रहे 
Neeraj Neer""",
    """हिज्र की ये रात है मगर मैं रो नही रहा
हर तरफ़ से मात है मगर मैं रो नही रहा

क्या सितम की अब मलाल भी नही जुदाई का
मौत की ज़कात है मगर मैं रो नही रहा

यूँ समझ कि जिस्म है बगैर रूह के अभी
क़ैद में हयात है मगर मैं रो नही रहा

हैफ़ बेबसी तो देखिए कि कहना पड़ रहा
ख़ुदकुशी की बात है मगर मैं रो नही रहा

नीर वो नही मिरी ये जान कर भी मौन हूँ
पहली वारदात है मगर मैं रो नही रहा 
Neeraj Neer""",
    """मोहब्बत हो अदावत हो तुम्हारे साथ रहना है
रफ़ाक़त हो रक़ाबत हो तुम्हारे साथ रहना है

शिकायत हो निहायत हो तुम्हारे साथ रहना है
कि अब कैसी भी हालत हो तुम्हारे साथ रहना है

तुम्हारे बिन अधूरा था तुम्हारे साथ पूरा हूँ
समझ लो तुम ज़रूरत हो तुम्हारे साथ रहना है

मैं देखूँ रोज़-ओ-शब बस तुम को जानाँ मसअला क्या है
तुम इतनी ख़ूबसूरत हो तुम्हारे साथ रहना है

सोहेल-ए-ख़स्ता की ख़्वाहिश तुम्हारे साथ रहने की
सदा-ए-कुन इजाबत हो तुम्हारे साथ रहना है 
'Shaikh Sohail'""",
    """तू ही बर्बाद करे तू ही सम्भाले दिल को
आसरा तू ही दे और तू ही निकाले दिल को

दिल को आदत नहीं इस सादगी पर मरने की
ये तिरी सादा-दिली मार न डाले दिल को

ये तिरे रुख़ पे जो तिल है ना वो सुबहान-अल्लाह
दौलत-ए-हुस्न है अच्छे से सता ले दिल को

तेरे हर ज़ख्म को मैं दिल से लगा लेता हूँ
तू भी तो काश कभी मुझ से लगा ले दिल को

दिल पे ऐ शख़्स क़यामत सी गुज़र जाएगी
इक दफ़ा अपनी निगाहों से चुरा ले दिल को

वस्ल के दिन तो गए हिज्र की शब आई है
फिर कहीं जा तू कहीं जा के छुपा ले दिल को

सुर्ख़ क़ालीन नहीं हम से बिछाई जाती
तेरी राहो मे बता कैसे बिछा ले दिल को

मेरे इज़हार पे कहती हो मज़ाक अच्छा है
इस से बहतर है कि तू सब से लगा ले दिल को

ऐ ख़ुदा अब न तमन्ना है मुझे उस दिल की
वो तो किश्तों मे खिलाती है निवाले दिल को

यूँ तो हर चीज़ सलामत है 'सुहैल' इस दिल की
ख़ैर तू जा के कहीं कर दे हवाले दिल को 
'Shaikh Sohail'""",
    """उन के रुख़सार पे मर मर के वो आना दिल का
कितना मुश्किल है हसीनों से बचाना दिल का

हम सुनाए जो कभी दिल से फ़साना दिल का
सब सुना पर वो कभी दर्द ना जाना दिल का

हम को आता है फ़क़त दिल से लगाना दिल का
उन को आया है तो बस दिल ही दिखाना दिल का

उन का अंदाज़-ए-अदावत कहो सुबहान-अल्लाह
वो तो सीधा ही लगाते हैं निशाना दिल का

ठीक से बात भी करने नहीं आती थी उन्हें
अब तो आ जाता है औरों से लगाना दिल का

मात खाते हैं यहाँ दिल को लगाने वाले 
भारी पड़ जाता है अक्सर यूँ लगाना दिल का

बे-रूख़ी ऐसी के अब हाए परेशान है दिल,
बे-दिली ऐसी के हम ढूँढे ठिकाना दिल का

जब थे वो साथ तभी दिल पे यूँ जलवा था के अब
उन के ना होने से लगता है ना होना दिल का

जब कभी रास्ते में दफ़'अतन मिल जाए कहीं
उन को बस देखते फूले ना समाना दिल का

उन से मिलने को 'सोहेल' इतना मचलते भी हो
उन से ना मिलने पे करते हो बहाना दिल का 
'Shaikh Sohail'""",
    """अपना हसीन चेहरा दिखाओ ना तुम कभी
ओ दिल फ़रेब दिल को लगाओ ना तुम कभी

पर्दा नशीली आँखों को जो देखते हैं हम
वो रुख़ से अपने पर्दा हटाओ ना तुम कभी

मेरी निगाह-ए-इश्क़ की हसरत है बस यही
अपनी निगाह-ए-नाज़ लूटाओ ना तुम कभी

तुम गुलसिताँ में एक कली की बहार हो
मेरे चमन में फूल को खिलाओ ना तुम कभी

गुल-हाए-रंग-रंग मिले तुम को देख कर
दिल हाए संग संग मिलाओ ना तुम कभी

एजाज़-ए-शायरी कहो अपनी ज़बान से
ख़स्ता सोहैल शे'र सुनाओ ना तुम कभी 
'Shaikh Sohail'""",
    """ये ग़म तो दिल की आदत है, करें क्या? 
वुफ़ूर-ए-ग़म में लत-पत है, करें क्या? 

रूदाद-ए-ग़म किसे मिल कर सुनाए? 
शरीक-ए-ग़म से दहशत है, करें क्या? 

शरीक-ए-रंज-ओ-राहत जो मिला है
वो अंदोह-ए-समा'अत है, करें क्या?

सोहेल-ए-बे-सुख़न-ना-चीज़-ओ-ख़स्ता
को ग़म रखने की आदत है, करें क्या? 
'Shaikh Sohail'""",
    """ना जाने कहाँ मेरे ख़्वाबों की दुनिया
बसर करती जिसमें गुलाबों की दुनिया

वो पर्दा-नशीली सी आँखों का मंज़र
वो मासूम सी बा-हिजाबों की दुनिया

जो दुनिया में तर्क-ए-अना से था ग़ाफ़िल
उसे क्या ख़बर हो सवाबों की दुनिया 

हमारी ग़ज़ल का सितम इतना सा है 
लिखा है हमीं ने अज़ाबों की दुनिया

सोहेल ऐसी दुनिया उन्हीं को मुबारक
जिन्हें हो हवस ला-जवाबों की दुनिया 
'Shaikh Sohail'""",
    """अधूरा रह गया सपना हमारा
मुहब्बत में नहीं हिस्सा हमारा

हुई हैं घर में देवी चार वल्लाह
हुआ क्या जो नहीं बेटा हमारा

अगर तुम फूल ले लेतीं उसी दिन
अभी तक नाम चल जाता हमारा

बिछड़ जाते हैं सारे लोग जैसे
बिछड़ता क्यों नहीं साया हमारा

वो लड़की भागने में भी थी राज़ी
पर इस पे मन नहीं माना हमारा

कोई समझा नहीं इस दर्द-ए-दिल को
हमीं बस पढ़ सके लिक्खा हमारा

ये दुनिया भेज दे वनवास हमको
नहीं तो फूँक दे पुतला हमारा

इक अफ़सर ब्याह उसको ले गया है
मिला कर ख़ाक में रुतबा हमारा

ग़ुलामी इश्क़ तक की कर न पाए
कहीं पर सर नहीं झुकता हमारा 
Rohit tewatia  'Ishq'""",
    """उसकी ज़ुल्फ़ों के उड़कर लहराने में
काफ़ी वक़्त लगा हमको टकराने में

भिड़ जाए जो इक की ख़ातिर दुनिया से
इतनी ताक़त होती है दीवाने में

आँखें बोला करती थीं दिल सुनता था
अब तो बातें लगती हैं समझाने में

वीराने में ही इक घर बनवाऊँगा
तन्हाई करती है घर वीराने में

पहली चाहत भूल नहीं पाए हैं हम
दिक़्क़त बाक़ी कोई नहीं दोहराने में

ख़ुद पैरों पर कौन कुल्हाड़ी मारे है
हमको तुमसे इश्क़ हुआ अनजाने में 
Rohit tewatia  'Ishq'""",
    """तेरी पूरी हर इक हसरत करूँगा मैं
जो हो क़ीमत अदा क़ीमत करुँगा मैं

लकीरें हाथ की सारी मिटा दूँगा
फिर अपने हाथ से मेहनत करूँगा मैं

अभी छोड़ो अगर है छोड़ना मुझको
नहीं तो कल बहुत दिक़्क़त करूँगा मैं

कोई तुझपर अगर उँगली उठाएगा
रखेगा याद वो हालत करूँगा मैं

कोई रह तो ले सारी उम्र मेरे साथ
मगर इस बात पे हैरत करूँगा मैं

मेरा दिल तोड़ दो और शौक़ से तोड़ो
प टूटे दिल से फिर गफ़लत करूँगा मैं

मेरे तो नाम तक में 'इश्क़' आता है
किसी से क्या भला नफ़रत करूँगा मैं 
Rohit tewatia  'Ishq'""",
    """मोहब्बत जिससे करते हैं ख़ुदा का मान देते हैं
ख़ुदा के इक इशारे पर हम अपनी जान देते हैं

तुम्हारी हमपे चलती है तो है सब कुछ सर आँखों पर
हमारी जिस पे चलती है उसे फ़रमान देते हैं

जो पहले छीन लेते हैं हमारी रौशनी हम से
चराग़ आकर वही तशहीर के दौरान देते हैं

बस इक थप्पड़ सज़ा है दोस्त उसको चूमने की सो
हुई ग़लती का हम भी रोज़ ही भुगतान देते हैं

किया है इश्क़ तो इसमें मुनाफ़ा क्या ख़सारा क्या
फ़क़त हम तो इसे ईनाम का उन्वान देते हैं 
Rohit tewatia  'Ishq'""",
    """इज़्ज़त अलग ही होती है फिर दोस्त यार में
गर आदमी लगा हो किसी रोज़गार में

पहले तो सोचा ख़्वाब में आकर मिलोगी तुम
फिर नींद टूटने न दी इस इंतिज़ार में

वालिद ने काँधे पे मेरे क्या हाथ रख दिया
और चार चाँद लग गये तब से वक़ार में

करती थी रोज़ रोज़ सितम हमपे ज़िंदगी
मारा है मौत ने ही फ़क़त एक बार में

क़द में बड़ा हूँ इसलिए बस छाँव सबको दी
सूरज से वरना तेज हूँ मैं ताबदार में

हमको तो इश्क़ भी कई सौ बार है हुआ
इक बार भी नहीं था मगर इख़्तियार में 
Rohit tewatia  'Ishq'""",
  ];
  List love = [
    """हकीकत कहो तो उन्हें ख्वाब लगता है,
शिकवा करो तो उन्हें मज़ाक लगता है,
कितनी शिद्दत से हम उन्हें याद करते हैं,
और एक वो हैं जिन्हें ये सब मजाक लगता है।""",
    """तेरी मोहब्बत ने हमे बेनाम कर दिया,
हमे हर ख़ुशी से अंजान कर दिया,
हमने तो कभी नही चाहा था हमे मोहब्बत हो,
लेकिन उसकी पहली नज़र ने हमे नीलाम कर दिया।""",
    """इस नजर ने उस नजर से बात करली,
रहे खामोश मगर फिर भी बात करली,
जब मोहब्बत की फ़िज़ा को खुश पाया,
तो दोनों निगाहों ने रो रो कर बरसात करली।""",
    """तुझे देख कर ये जहाँ रंगीन नजर आता है,
तेरे बिना दिल को चैन कहां आता है,
तू ही है मेरे इस दिल की धड़कन,
तेरे बिना ये जहां बेकार नज़र आता है।""",
    """तू तोड़ दे वो कसम जो तूने खाई है,
कभी कभी याद करने में क्या बुराई है,
तुझे याद किये बिना रहा भी तो नही जाता,
तूने दिल में जगह जो ऐसी बनाई है।""",
    """इश्क सभी को जीना सीखा देता है,
वफ़ा के नाम पर मरना सीखा देता है,
इश्क नही किया तो करके देखना,
ज़ालिम हर दर्द सहना सिखा देता है।""",
    """आपकी परछाई हमारे दिल में है,
आपकी यादें हमारी आँखों में हैं,
आपको हम भुलाएं भी कैसे,
आपकी मोहब्बत हमारी सांसो में हैं।""",
    """तेरी झील सी आँखों में डूब जाने का दिल चाहता है,
वफ़ा पर तेरी बर्बाद हो जाने का दिल चाहता है,
कोई सम्भाले हमे, बहक रहे हैं कदम,
तेरे इश्क में मर जाने का दिल चाहता है।""",
    """ये तुमसे किसने कहा तुम इश्क का तमाशा करना,
अगर मोहब्बत करते हो हमसे तो बस हल्का सा इशारा करना।""",
    """किसी न किसी को किसी पर एतवार हो जाता है,
एक अजनबी सा चेहरा ही यार हो जाता है,
खूबियों से ही नही होती मोहब्बत सदा,
किसी की कमियों से भी कभी प्यार हो जाता है।""",
    """दिल का हाल बताना नही आता,
हमे ऐसे किसी को तड़पाना नही आता,
सुनना तो चाहतें हैं हम उनकी आवाज़ को,
पर हमे कोई बात करने का बहाना नही आता।""",
    """हर कदम हर पल हम आपके साथ है,
भले ही आपसे दूर सही, लेकिन आपके पास हैं,
जिंदगी में हम कभी आपके हो या न हों,
लेकिन हमे आपकी कमी का हर पल एहसास हैं।""",
    """इश्क करती हूँ तुझसे अपनी जिंदगी से ज्यादा,
मैं डरतीं हूँ मौत से नही तेरी जुदाई से ज्यादा,
चाहे तो हमे आज़मा कर देख किसी और से ज्यादा,
मेरी जिंदगी में कुछ नही तेरी आवाज़ से ज्यादा।""",
    """जब खामोश निगाहों से बात होती है,
तो ऐसे ही मोहब्बत की शुरुआत होती है,
हमतो बस खोये ही रहतें हैं उनके ख्यालों में,
पता ही नही चलता कब दिन कब रात होती है।""",
    """आग लगी दिल में जब वो खफ़ा हुए,
एहसास हुआ तब, जब वो जुदा हुए,
करके वफ़ा वो हमे कुछ दे न सके,
लेकिन दे गये बहुत कुछ जब वो वेबफा हुए।""",
    """जिंदगी में कोई प्यार से प्यारा नही मिलता,
जिंदगी में कोई प्यार से प्यारा नही मिलता,
जो है पास आपके उसको सम्भाल कर रखना,
क्योंकि एक बार खोकर प्यार दोबारा नही मिलता।""",
    """बहुत सुकून मिलता है जब उनसे हमारी बात होती है,
वो हजारो रातों में वो एक रात होती है,
जब निगाहें उठा कर देखते हैं वो मेरी तरफ,
तब वो ही पल मेरे लीये पूरी कायनात होती है।""",
    """Tumhe Dekhte Hi Ye Dil
Bekarar Hone Laga Hai
Teri Chaahat Par Mujhe
Iqrar Hone Laga Hai..""",
    """Teri Aankhon Mein Mujhe
Ishq Najar Aata Hai
mera yeh Dil Tujhe
Beintehaan Chahta Hai..""",
    """Haskar Dard Ko
Seene Se Lagana hai
Tere Palkon Ke Ashkoon Se
Yun Hi Bheeg Jana Hai..""",
    """Ishq Ka Junoon Jab
Kisi Ko Chadhta hai
tab yeh Dil Pyar ki
nayi Kahani likhta Hai..""",
    """Deedar Ko Tere miloo
SaFar Karke aaya hoon
bus Tere Naino Ke Sagar mein
khone es Dil Ko Laya hoon.."""
  ];
  List dosti = [
    """Ek sabse achhi kithab sau sabse achhe doston ke barabar hothi hai, lekin ek sabse achha dosth ek library ke barabar hotha hai.""",
    """Kis tarah ki achhayi, kis tarah ka bharosa, kis tarah ki dosthj, kis tarah ke pyar ki aap doosron se ummeed karthe hai, iski shuruath sabse pahle aapse honi chahie.""",
    """Friendship is a bond of love and trust,
A journey that is always a must.
Together we laugh, together we cry,
A bond that will never, ever die""",
    """Friendship is not about whom you have known the longest,
It's about who came and never left your side""",
    """True friends are like stars,
You don't always see them,
But you know they're always there""",
    """A friend is someone who understands your past,
Believes in your future,
And accepts you just the way you are""",
    """Friendship is a promise made in the heart,
Silent and unbreakable by any distance or time""",
    """The beauty of friendship is not in the countless words spoken,
But in the silent understanding and mutual support""",
    """A true friend is someone who never gets tired of listening
to your pointless dramas over and over again.""",
    """A friendship that can withstand the test of time
is a treasure worth keeping forever.""",
"""Friendship is not about being inseparable,
it's about being separated and nothing changes""",
"""True friends are the ones who are always there
to catch you when you fall, and lift you up when you stumble""",
"""Friendship is a strong and constant thread
that ties our souls together.""",
"""A true friend is someone who is always there
to lend an ear and a helping hand""",
"""Friendship is a bond that cannot be broken,
even by distance or time.""",
  ];

@override
  void initState() {
    // TODO: implement initState
    super.initState();
    if(widget.index==0){
      temp = ghazal;
    }else if(widget.index==1){
      temp = shayar;
    }else if(widget.index==2){
      temp = rahatindori;
    }else if(widget.index==3){
      temp = mirzagalib;
    }else if(widget.index==4){
      temp = ghazalgeet;
    }else if(widget.index==5){
      temp = love;
    }else if(widget.index==6){
      temp = dosti;
    }
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: Color(0xF4FFFFFF),
      appBar: AppBar(
        title: Text(
          "${widget.gridlist[widget.index]}",
        ),
        backgroundColor: const Color(0xFFff70a6),
        elevation: 5,
      ),
      body: ListView.builder(
        itemCount: temp.length,
        physics: BouncingScrollPhysics(),
        itemBuilder: (context, index) {
          return InkWell(
            onTap: () {

            },
            child: Card(
              margin: EdgeInsets.all(10),
              child: Column(
                children: [
                  Container(
                      constraints: BoxConstraints(minHeight: 80),
                      alignment: Alignment.centerLeft,
                      margin: EdgeInsets.all(15),
                      child: Text(
                        temp[index],
                        style: TextStyle(fontSize: 18),
                      )),
                  Container(
                    color: Colors.blueGrey.shade500,
                    child: Row(
                      mainAxisAlignment: MainAxisAlignment.spaceEvenly,
                      children: [
                        IconButton(
                          onPressed: () {
                            Share.share("${temp[index]}");
                          },
                          tooltip: "share",
                          highlightColor: Colors.transparent,
                          splashColor: Colors.transparent,
                          hoverColor: Colors.transparent,
                          focusColor: Colors.transparent,
                          disabledColor: Colors.transparent,
                          icon: Icon(Icons.share_rounded),
                          color: Colors.white,
                        ),
                        IconButton(
                          onPressed: () {
                            FlutterClipboard.copy("${temp[index]}").then((value) {
                            Fluttertoast.showToast(
                            msg: "Copied",
                            toastLength: Toast.LENGTH_SHORT,
                            gravity: ToastGravity.BOTTOM,
                            //timeInSecForIosWeb: 3,
                            backgroundColor: Colors.blue.shade900,
                            textColor: Colors.white,
                            fontSize: 16.0);
                      });
                          },
                          tooltip: "copy",
                          highlightColor: Colors.transparent,
                          splashColor: Colors.transparent,
                          hoverColor: Colors.transparent,
                          focusColor: Colors.transparent,
                          disabledColor: Colors.transparent,
                          icon: Icon(Icons.copy_outlined),
                          color: Colors.white,
                        ),
                        
                      ],
                    ),
                  ),
                ],
              ),
            ),
          );
        },
      ),
    );
  }
}